import React, { useEffect, useState, useContext } from "react";
import Text from "../commonComponents/Text";
import Image from "../commonComponents/Image";
import { Context } from "../context/Context";
import { PrivayPolicyText as text } from "../Database/Text";
import gbattleLogo from '../assets/gmobileMongolia/2-min.png'
import {SendGuiDataEvents} from '../commonScript';


function PrivacyPolicy() {
  const [lang, setLang] = useState("en");
  const { getLanguage } = useContext(Context);

  useEffect(() => {
    window.scrollTo(0, 0);
    setLang(getLanguage());
    let guiDataEvent = {}
    guiDataEvent['page'] = 'privacy_policy';
    guiDataEvent['event'] = 'open';
    SendGuiDataEvents(guiDataEvent);
  }, []);

  return (
    <>
      {/* <Header title={"FAQs"} wallet={false} back={true} home={true} /> */}
      <div className="bg-primary min-w-screen flex flex-col justify-center">
        <div className="w-full bg-white border border-white">
          <div className="flex justify-center py-4">
            <Text
              tag="h3"
              scale={true}
              styles=""
              text={text.privayPolicy[lang]}
              fontweight="bold"
            />
            {/* <p>Mobibattle FAQs</p> */}
          </div>
          
          <Image 
            url = {gbattleLogo}
            styles ="w-10 h-10 mx-auto"
          />
          
          <div className="flex flex-col justify-center px-4">
            <h3 className="font-bold my-2 text-center">ҮЙЛЧИЛГЭЭНИЙ ТАНИЛЦУУЛГА</h3>
            <p className="my-2" >“G Battle” нэмэлт үйлчилгээ нь урьдчилсан төлбөрт үйлчилгээний хэрэглэгчдэд зориулсан орчин үеийн PUBG, Free fire, FIFA, Mobile legend гэх мэт өрсөлдөөнт тоглоомын тэмцээнд суурилсан үйлчилгээ юм.</p>
           
            <h3 className="font-bold my-2 mt-5 text-center">“G BATTLE” БАГЦЫН ТӨРӨЛ</h3>          
             {/* table 1 */}
             <table style={{ borderCollapse: "collapse"}}>
                  <tr className="border-2">
                    <th className="border-2 px-1">№</th>
                    <th className="border-2 px-1">Багцын төрөл</th>
                    <th className="border-2 px-1">Багцын нэр</th>
                    <th className="border-2 px-1">Хугацаа</th>
                    <th className="border-2 px-1">Үнэ</th>
                  </tr>
                  <tr className="border-2">
                    <td className="border-2 px-1">1</td>
                    <td rowSpan={3} className="border-2 px-1">G Battle багц</td>
                    <td className="border-2 px-1">1 хоногийн G Battle багц</td>
                    <td className="border-2 px-1">1 хоног</td>
                    <td className="border-2 px-1">300₮</td>
                  </tr>
                  <tr className="border-2">
                    <td className="border-2 px-1">2</td>
                    <td className="border-2 px-1">7 хоногийн G Battle багц</td>
                    <td className="border-2 px-1">7 хоног</td>
                    <td className="border-2 px-1">1500₮</td>
                  </tr>
                  <tr className="border-2">
                    <td className="border-2 px-1">3</td>
                    <td className="border-2 px-1">30 хоногийн G Battle багц</td>
                    <td className="border-2 px-1">30 хоног</td>
                    <td className="border-2 px-1">6000₮</td>
                  </tr>
            </table>
            <p className="my-2">Тухайн идэвхжүүлсэн багцыг www.gbattle.mn веб хуудас руу нэвтэрч ороход ашиглах ба та тоглоомын өрөөнд орж энгийн болон өрсөлдөөнт тоглоомыг тоглохдоо заавал койн худалдан авсан байх шаардлагатай.</p>
            


            <h3 className="font-bold my-2 mt-5 text-center">НЭГЖЭЭ КОЙН БОЛГОХ</h3>          
             {/* table 2 */}
             <table style={{ borderCollapse: "collapse"}}>
                  <tr className="border-2">
                    <th className="border-2 text-center">№</th>
                    <th className="border-2 text-center">Нэгж</th>
                    <th className="border-2 text-center">Койн</th>
                  </tr>
                  <tr className="border-2">
                    <td className="border-2 text-center">1</td>
                    <td className="border-2 text-center">500₮</td>
                    <td className="border-2 text-center">500 койн</td>
                  </tr>
                  <tr className="border-2">
                    <td className="border-2 text-center">2</td>
                    <td className="border-2 text-center">1000₮</td>
                    <td className="border-2 text-center">1000 койн</td>
                  </tr>
                  <tr className="border-2">
                    <td className="border-2 text-center">3</td>
                    <td className="border-2 text-center">1500₮</td>
                    <td className="border-2 text-center">1500 койн</td>
                  </tr>
                  <tr className="border-2">
                    <td className="border-2 text-center">4</td>
                    <td className="border-2 text-center">2000₮</td>
                    <td className="border-2 text-center">2000 койн</td>
                  </tr>
                  <tr className="border-2">
                    <td className="border-2 text-center">5</td>
                    <td className="border-2 text-center">2500₮</td>
                    <td className="border-2 text-center">2500 койн</td>
                  </tr>
            </table>
            <p className="my-2">Та 5 төрлийн койноос сонгон өөрийн G Battle хэтэвчийг цэнэглэж, тоглоомын өрөө рүү нэвтэрч бусад хэрэглэгчидтэй тоглох боломжтой.</p>
            
            <h3 className="font-bold my-2 mt-5 text-center">ТОГЛООМЫН ӨРӨӨНД НЭВТРЭХ</h3>          
             {/* table 3 */}
             <table style={{ borderCollapse: "collapse"}}>
                  <tr className="border-2">
                    <th className="border-2 text-center">№</th>
                    <th className="border-2 text-center">Нэгж</th>
                    <th className="border-2 text-center">Койн</th>
                  </tr>
                  <tr className="border-2">
                    <td className="border-2 text-center">1</td>
                    <td style={{maxWidth:"100px"}} rowSpan={5} className="border-2 text-center">Тэмцээний өрөөнд бүртгүүлэх койны хэмжээ</td>
                    <td className="border-2 text-center">50 койн</td>
                  </tr>
                  <tr className="border-2">
                    <td className="border-2 text-center">2</td>
                    <td className="border-2 text-center">100 койн</td>
                  </tr>
                  <tr className="border-2">
                    <td className="border-2 text-center">3</td>
                    <td className="border-2 text-center">150 койн</td>
                  </tr>
                  <tr className="border-2">
                    <td className="border-2 text-center">4</td>
                    <td className="border-2 text-center">200 койн</td>
                  </tr>
                  <tr className="border-2">
                    <td className="border-2 text-center">5</td>
                    <td className="border-2 text-center">250 койн</td>
                  </tr>
            </table>
            <p className="my-2">Та 5 төрлийн койноос сонгон өөрийн G Battle хэтэвчийг цэнэглэж, тоглоомын өрөө рүү нэвтэрч бусад хэрэглэгчидтэй тоглох боломжтой.				</p>
      
				
            <p className="my-2">Өрсөлдөөнт тоглоомын төрөл хэсэгт тэмцээн болох хугацааг заасан өрөөнүүд үүссэн байх ба та өөрийн G Battle хэтэвчинд байршуулсан койноо ашиглан тоглолтод оролцох боломжтой.</p>
            <p className="my-2">Тоглоомын төрлөөс хамааран хэрэглэгчийн G Battle хэтэвчнээс хасагдах койны хэмжээ өөр байна.</p>
            <p className="my-2">Ялагч болсон тохиолдолд тухайн тоглолтын өрөөнд байршсан нийт койныг авах боломжтой ба ялагч болсон тухайн үед таны G Battle хэтэвчинд хожлын койн орно.</p>
            <p className="my-2">Хэрэглэгч хожлын койноо зөвхөн www.gbattle.mn веб хуудсанд бүртгүүлсэн урьдчилсан төлбөрт үйлчилгээний дугаартаа нэгж болгон авах боломжтой.</p>
            
            {/* <p className="my-2"><span className="font-bold">II. Холбоос: </span> Мобибатле нь Үйлчилгээнийхээ хүрээнд холбоосуудтай яаж харилцаж байгааг цахим шуудангийн анхааруулга, гуравдагч талын үйлчилгээ болон түншийн хэрэглэгдэхүүн зэргийг хамааруулан товшилтоор холбоосын чиглэлийг өөрчлөх эсвэл өөр төхөөрөмжөөр дамжуулан хянах боломжтой.</p>
            <p className="my-2"><span className="font-bold">III. Ашиглалтын мэдээлэл: </span> Сервер нь автоматаар таны Үйлчилгээг ашигласнаар үүсгэгдсэн мэдээллийг бичнэ. Эдгээр мэдээлэл нь таны IP хаяг, браузерийн төрөл, үйлдлийн систем, хандаж байгаа веб хуудас, зочилсон хуудсууд, байрлал, таны мобил зөөгч, төхөөрөмжийн ID, хайлтын нөхцлүүд болон шаралтын мэдээллүүд зэргийг агуулна. Ашиглалтын мэдээллүүд нь таныг Үйлчилгээтэй харилцах үед үүснэ. Эдгээр мэдээллүүд нь Үйлчилгээ үзүүлэх, түүнийг хэмжих, сонгох болон тэдгээрийг сайжруулахад ашиглагдана.</p>
            <p className="my-2"><span className="font-bold">IV. Төлбөрийн мэдээлэл: </span> Төлбөрийн мэдээлэл: Хэрвээ та Үйлчилгээгээр худалдан авалт хийвэл Мобибатле нь төлбөртэй холбоотой санхүүгийн шаардлагатай мэдээллүүд болон тооцооны баримтыг цуглуулах буюу холбогдох төлбөрийн үйлчилгээ үзүүлэгчдийг орлож ажиллана. Гуравдагч талын үйлчилгээг худалдан авах нь ийм үйлчилгээ үзүүлэгчид ашиглагдахуйц бодлогын обьект юм.</p>
            <p className="my-2"><span className="font-bold">V. Гуравдагч талын үйлчилгээ: </span>Мобибатле нь Үйлчилгээнийхээ үйл ажиллагааг хэрэгжүүлэхийн тулд гуравдагч талын үйлчилгээг тухайлбал, эзэмших болон бусад үйлчилгээнүүдийг ашигладаг. Эдгээр гуравдагч талын үйлчилгээ үзүүлэгчид нь таны браузерийн илгээсэн мэдээллийг веб хуудасны хүсэлтийн хэсэг байдлаар тухайлбал, шаралтууд эсвэл IP хаяг, байршил болон төхөөрөмжийн давтагдашгүй индикаторуудыг цуглуулах болно. Түүнчлэн гуравдагч талын зар сурталчилганы түншүүд нь зар сурталчилгаа болон захиалгат сурталчилгаануудын чанарыг үнэлэх мэдээллийг өгч болно. </p> */}
            {/* <p className="my-2"><span className="font-bold">VI. Хэрэглэгчид үзүүлэх дэмжлэг туслалцаа уялдаа холбоо:</span> VI. Хэрэглэгчид үзүүлэх дэмжлэг туслалцаа уялдаа холбоо:</p>
            <h3 className="font-bold my-2">Мэдээллийг ашиглах</h3>
            <p>Та Үйлчилгээнд данс үүсгэхийн тулд өөрийн нэр, болон ээлж дараагаар нэхэгдэж байгаа бусад мэдээллүүдийг өгөх хэрэгтэй болно. Зарим мэдээллүүд тухайлбал, таны нэр Үйлчилгээгээр таны нүүр хуудсаар хайлтанд орж олон нийтэд ил болох болно. Мобилбатле болон/эсвэл гуравдагч талууд мөн тэдгээрийн нэрийн өмнөөс хэрэглэгчид дэмжлэг туслалцаа үзүүлэх зорилгоор таньтай холбогдох зорилгоор таны мэдээллийг ашиглах, Үйлчилгээний шинэ мэдээллийг илгээх, таны данс Үйлчилгээн дэх харилцааг зохицуулах, таны ашиглалтын туршлагыг сайжруулах, хайлт, тандалт, таны оролцоотойгоор Үйлчилгээг дээшлүүлэх тухайлбал, Үйлчилгээ болон бүтээгдэхүүний урамшуулал, зах зээлийн судалгааны зорилгоор таньд судалгаа явуулах, Үйлчилгээг илүү мэргэжлийн, оновчтой болгох, урамшуулах, сурталчлах, судалгаа болон бизнесийн зорилгоор ижил төсөөтэй үйлчилгээнд шинжилгээ хийж тайлан бичих</p>
            <h3 className="font-bold my-2">Мэдээллийг түгээх ба нууцлах</h3>
            <p>Мобибатле нь Бодлогын баримт бичгийн дагуу гуравдагч талтай мэдээллийг хуваалцах нь Үйлчилгээг үзүүлэхэд нэн чухал шаардлагатай. Тухайлбал, Мобибатле Үйлчилгээгээ бүрэн дүүрэн үзүүлэхийн тулд хэрэглэгчийг мэдээллээр хангах, таны зааварчилгааг биелүүлэхэд чухал ач холбогдолтой тухайлбал, төлбөр төлөх үед таны мэдээлэл төлбөрийн процессорт байх ёстой бөгөөд тэнд таны мэдээлэл танигдахгүй нийтлэг байдалтай байгаа нь та албан ёсоор танигдаагүйг илэрхийлнэ. Бодлогын баримт бичигт заасан байдлаар Сонирхолд үндэслэсэн Зар сурталчилгааг хүргэхэд, та мэдээллээ шалгаруулалтын нэг хэсэг болгож илгээх буюу аливаа нэг суваг эсвэл олон нийтийн мэдээлийн хэрэгсэлтэй харилцахад таны мэдээлэл олон нийтэд цацагдах боломжтой.. Хууль ёсны үүргээ биелүүлэх буюу Бодлогын баримт бичиг, Нөхцлүүд болон бусад гэрээнүүдийг хэрэгжүүлэх, Мобибатле ба гуравдагч талын эрх, өмчийг хамгаалахын тулд үүнийг хууль тогтоомжоор зөвшөөрөгдсөн гэж үздэг.</p>
            <h3 className="font-bold my-2">Нөхцөл</h3>
            <p>Мобибатле нь тодорхой зорилготой буюу Үйлчилгээ үзүүлэхэд шаардлагатай цуглуулсан мэдээллээ удаан хугацаанд түүгээр ч үл барам та үйл ажиллагаагаа зогсоох буюу дансаа устгасан, Үйлчилгээний нөхцөл дуусгавар болсоны дараа ч  хадгалах боломжтой. Хэрвээ эдгээр мэдээллүүдийг хадгалах нь хууль ёсны үүргээ биелүүлэх, тохируулах агентлагуудын шаардлагыг хангах, хэрэглэгч хоорондын маргааныг шийдвэрлэх, залилан мэхлэлтээс урьдчилан сэргийлэх болон бусад шаардлагаар чухал ач холбогдолтой юм.</p>
            <h3 className="font-bold my-2">Мэдээллийг хамгаалах</h3>
            <p>Мобибатле мэдээллийг зохих ёсоор техникийн болон биет байдлаар гэмт хэргийн шинжтэй, хууль бусаар алдагдах, өөрчлөх, итгэмжлэлгүйгээр ил тод болгох буюу нэвтрэх зэрэг хууль бус хэлбэрээр өмчилж байгаа мэдээллийг боловсруулах байдлаас хамгаалдаг.Гэвч Мобибатле нь дээр дурьдсан нэвтрэх, ил тод болгох, өөрчлөх, устгах зэрэг зөрчлөөс хамгаалах баталгааг гаргахгүй. Мэдээлэл нь дэлхийн хаана ч хүрч , хадгалагдаж болно.Мобибатле нь Бодлогын баримт бичгийн дагуу мэдээллүүдийг найдвартай хадгалахын тулд бүх шаардлагатай арга хэмжээнүүдийг авч байна. Мобибатле нь дампуурах, нэгдэх, өргөжих, өөрчлөн зохион байгуулагдах буюу өмч хөрөнгөө борлуулахад таны мэдээлэл түүний нэг хэсэг болж хамтдаа зарагдах буюу шилжих болно. Бодлогын баримт бичиг дэх заалтууд нь шинэ хуулийн этгээдэд шилжиж мэдээллийн журмаар ашиглагдана.</p>
            <p className="my-2">Үйлчилгээнд та гуравдагч талын цахим хуудасны холбоосыг олж болно. Та эдгээр холбоосууд дээр товшиж мэдээлэл өгсөний дараа энэ нь Мобилбатле-ийнх биш гуравдагч талын бодлогын обьект гэдгийг ойлгох болно.Үүнээс улбаалан Мобибатле нь гуравдагч талын веб хуудасны мэдээлэл, аюулгүй байдал, баталгаанд хариуцлага хүлээхгүй. Үйлчилгээ нь насанд хүрээгүй хүмүүстд зориулагдаагүй болно. Мобилбатле нь насанд хүрээгүй иргэний мэдээллийг мэдсэн тохиолдолд авдаггүй. Хэрвээ таны хуулийн насанд хүрээгүй хүүхэд хувийн мэдээлээ өгөхөөс болгоомжилж байгаа бол тухайн мэдээллийг устгах, дансыг идэвхгүй болгох алхмууд хийгдэх болно. Мөн та бага насны хүүхэд тань хувийн мэдээллээ өгөхөөс болгоомжилж байгаа бол <span className="text-blue-800 underline">support@gbattle.co</span> хаягаар холбоо бариарай. Та аль оронд оршин сууж байгаа болон хаанаас мэдээллээр хангаж байгаагаас үл хамааран Мобилбатле-ийн Баримт бичигт нийцүүлэн мэдээллийг ашиглах болон хадгалахдаа түүнд итгэж үйл ажиллагаа нь хүлээн зөвшөөрөгдсөн бүх орноос хандах боломжтой.</p>
            <p className="my-2">Энэ Бодлоготой зөрчилдсөн ямар ч заалтыг хүлээн зөвшөөрөхгүй. Мобибатле нь таны мэдээллийг хуулийн хүрээнд , түүний шаардлага зохицуулалтаар зохих хэмжээгээр, аливаа иргэний аюулгүй байдлыг хангаж, залилангийн асуудлыг шийдвэрлэх, нууцлах болон техникийн асуудлаар, эсвэл Мобибатле-ийн эрх, өмчлөлийн асуудлаар ил болгох болон хадгалах болно. Гэхдээ Бодлогын баримт бичигт хуулийн хамгаалалт болон гуравдагч талд гаргах гомдол ,түүний дотор таны мэдээллийг ил болгох засгийн газрын хүсэлтийг хязгаарлахаар тусгагдаагүй. Мобилбатле нь таны мэдээлэл аюулгүй ,нягт нямбай шинэчлэгдэх болно гэдэгт итгэхийг та бүхнээс хүсч байна. Та бүхэн Үйлчилгээний дансны тохиргоо болон хэрэгслүүдийг ашиглан мэдээллээ засах, сайжруулах эсвэл устгахаар хандаж болох буюу эсвэл Мобилбатле-ийн <span className="text-blue-800 underline">support@gbattle.co</span> хаягаар холбогдоорой.</p>
            <p className="my-2">"Аливаа шүүх болон эрх бүхий байгууллагаас Бодлогын баримт бичигт хүчингүй эсэл хүчин ₮өлдөр бус заалт илрүүлбэл энэ нь түүний бусад нөхцлүүдэд хамаарахгүй болно. Бодлогын баримт бичиг нь Ботсванын хуулийн дагуу орчуулагдан боловсруулагдсан юм. Бодлогын баримт бичигтэй холбоотой аливаа үүссэн маргаан нь Ботсван хотын шүүхэд харьяалагдах хууль зүйн онцгой обьект болно. Та бүхэн ийм шүүх ажиллагааны байршилыг хүлээн зөвшөөрч тааламжгүй форумд оролцохоос татгалзаарай. Мобибатле нь Бодлогын баримт бичгийн нэмэлт өөрчлөлт болон засварыг шаардлага гарсан цаг үед нь хийж гүйцэтгэж явах болно."</p> */}
          </div>
        </div>
      </div>
    </>
  );
}

export default PrivacyPolicy;
