import React, { useEffect, useState, useContext } from "react";
import Text from "../commonComponents/Text";
import { Context } from "../context/Context";
import {SendGuiDataEvents} from '../commonScript';


function TermsAndConditions() {
  const [lang, setLang] = useState("en");
  const { getLanguage } = useContext(Context);

  useEffect(() => {
    window.scrollTo(0, 0);
    setLang(getLanguage());
    let guiDataEvent = {}
    guiDataEvent['page'] = 'terms_condition';
    guiDataEvent['event'] = 'open';
    SendGuiDataEvents(guiDataEvent);
  }, []);
  return (
    <>
      {/* <Header title={"FAQs"} wallet={false} back={true} home={true} /> */}
      <div className="bg-primary min-w-screen flex flex-col justify-center">
        <div className="w-full bg-white border border-white">
          <div className="flex justify-center py-4">
            {/* <Text
              tag="h4"
              scale={true}
              styles=""
              text={text.termAndCondition[lang]}
              fontweight="bold"
            /> */}
          </div>
          <div className="px-8">
            <div>
              <h3 className="font-bold my-2">Нэгдүгээр зүйл - Хэрэгжилт</h3>
              <p className="mb-2">
                1.1 Доор дурдсан ерөнхий нөхцөл ("Нөхцөл") нь BlackNGreen-ээс
                (интернэтээр дамжуулан) санал болгож буй (мултимедиа)
                үйлчилгээний бүх санал, гүйлгээний нэг хэсэг бөгөөд цаашид товч
                байх үүднээс, КОМПАНИ, энэхүү Нөхцөлд цаашид дэлгэрэнгүй
                тайлбарласан эсэхээс үл хамааран үүрэн холбооны үйлчилгээ
                үзүүлэгч тус бүрийн ("Үйлчилгээ үзүүлэгч") сүлжээгээр дамжуулан
                Эцсийн хэрэглэгчийг захиалсан үйлчилгээгээр хангана ("Гар утсанд
                зориулсан захиалга үйлчилгээ"). Компанийн санал болгож буй
                (мултимедиа) үйлчилгээнд (интернэтээр дамжуулан) тоглоом, мессеж
                багтана.
              </p>
              <p className="mb-2">
                1.2 Компаниас урьдчилан бичгээр өгсөн зөвшөөрөл авахаас өөр
                тохиолдолд нөхцөл, болзлоос өөрөөр онцгойлон үзэх нөхцөлгүйгээр
                эдгээрийг чанд баримтална.{" "}
              </p>
            </div>
            <div>
              <h3 className="font-bold my-2">
                Хоёрдугаар зүйл - Контент үйлчилгээ үзүүлэх заалт
              </h3>
              <p className="mb-2">
                2.1 Эцсийн хэрэглэгч нь Үйлчилгээ үзүүлэгчийн сүлжээгээр
                дамжуулан үзүүлж буй Контент үйлчилгээг авах хүсэлт гаргана.
              </p>
              <p className="mb-2">
                2.2 Манай вэбсайт нь Фэйсбүүк, Твиттер болон бусад гуравдагч
                этгээдийн вэбсайтад контентоо хуваалцах холбоос өгдөг. Эдгээр нь
                зөвхөн хуваалцах ба/эсвэл зарлахад зориулагдсан бөгөөд манай
                вэбсайтад гарсан гуравдагч этгээдийн вэбсайт болон/эсвэл
                тэдгээрийн контентод бид хариуцлага хүлээхгүй ба гуравдагч
                этгээдийн аль нэг эсвэл бүх вэбсайтаас үүсэх аливаа хариуцлагыг
                бид хүлээхгүй. Энэ талаарх дэлгэрэнгүй мэдээллийг манай
                Нууцлалын бодлогоос харна уу.
              </p>
              <p className="mb-2">
                2.3 Бид гуравдагч этгээдийн вэбсайт дээр тухайн вэбсайтуудын
                хэрэглэгчид өөрсдөө дээр дурдсан холбоосууд дээр хуваалцах
                болон/эсвэл зарлалын зорилгоор нийтлэх контентод хариуцлага
                хүлээхгүй бөгөөд хэрэглэгчдийн бичсэн албан ёсны вэб хуудас
                эсвэл олон нийтийн сүлжээний платформ дээр аливаа контент
                ба/эсвэл сэтгэгдэлд бид хариуцлага хүлээхгүй.
              </p>
            </div>
            <div>
              <h3 className="font-bold my-2">Гуравдугаар зүйл - Хураамж</h3>
              <p className="mb-2">
                3.1 Gbattle нь танилцуулсан бүтээгдэхүүн, ашгийн төлөөх
                компанийн аль нэгтэй холбоогүй, ивээн тэтгүүлээгүй, дэмждэг
                аваагүй. Барааны тэмдэг, үйлчилгээний хүрээ, лого (үүнд
                бүтээгдэхүүн, брэндийн нэр зэрэг нь аливаа хязгаарлалтгүй
                багтана) тухайн компанийн өмч юм.
              </p>
              <p className="mb-2">
                3.2 Хураамж ("Хураамж") нь (i) Контент үйлчилгээний захиалга,
                (ii) Кредит ("Клубын үйлчилгээ") болон (iii) тусдаа захиалга
                гэдгээс хамааран вэбсайт руу дамжуулна. Стандарт Урьдчилсан
                төлбөрт захиалгын хувьд төлбөрийг Үйлчилгээ үзүүлэгч
                захиалагчийн данс руу хийдэг бол зоос худалдаж авах эсвэл
                эвентийн хураамж өгөх тохиолдолд Эцсийн хэрэглэгчийн урьдчилж
                төлсөн/Мобайл мөнгөний үлдэгдлээс суутгана. Эцсийн хэрэглэгч
                үүгээр хураамж төлөхийг зөвшөөрч буй бөгөөд төлбөрийг бүрэн
                барагдуулах үүрэгтэй.
              </p>
              <p className="mb-2">
                Захиалагчийн илгээсэн бүх мессежэд гар утасны үйлчилгээ
                үзүүлэгчээр дамжуулан стандартын дагуу төлбөр тооцогдоно. Үүрэн
                холбооны үйлчилгээ үзүүлэгч компаниас хамааран төлбөр өөр байна.
              </p>
            </div>
            <div>
              <h3 className="font-bold my-2">Дөрөвдүгээр зүйл - Төлбөр</h3>
              <p className="mb-2">4.1 Үйлчилгээг авч буй хэрэглэгч бүрд төлбөр тооцоог боловсруулах, зохицуулахад зориулсан хоёр төрлийн түрийвч өгнө: (i) Хадгаламжийн түрийвч, (ii) Хожлын түрийвч.</p>
              <ol className="px-8 list-disc">
                <p className="mb-2">Хадгаламжийн түрийвч дэх зоосыг зөвхөн хэрэглэгчийг тэмцээнд оролцох боломжийг олгоход ашиглах боломжтой бөгөөд буцааж авах боломжгүй.</p>
                <p className="mb-2">Та Хадгаламжийн түрийвч рүү тодорхой мөнгө байршуулсны дараа л хожлын түрийвчнээс анхны мөнгө авах боломжтой.</p>
                <p className="mb-2">Аливаа тэмцээнд хожсон мөнгийг тань хожлын түрийвч рүү шилжүүлнэ. </p>
                <p className="mb-2">Хожлын түрийвч дэх зоосыг татаж авах боломжтой бөгөөд үүнийг хэрэглэгчийн дансыг ашиглан хийх эсвэл аливаа тэмцээнд оролцохдоо ашиглаж болно. Бид өөрийн хүслээр мөнгө татах хамгийн бага ба дээд босго хэмжээг тодорхойлж болно. Хэрэглэгч өдөрт зөвхөн нэг удаа мөнгө татан авах боломжтой. Дээр дурдсан хязгаарлалтыг бид өөрсдийн хүслээр хүссэн үедээ өөрчилж болно.</p>
                <p className="mb-2">Бусад нөхцөлийн дагуу та Хадгаламжийн түрийвчдээ дор хаяж нэг удаа зоос нэмсэн тохиолдолд хожлын түрийвчнээс мөнгө татах эрхтэй. Бид хожлын түрийвчнээс мөнгө авах эрхтэй болохын тулд хийх ёстой хадгаламжийн мөнгөн дүнг тодорхойлох, дүнг өөрчлөх эрхтэй.</p>
              </ol>
              <p className="mb-2">4.2. Таныг аливаа тэмцээнд оролцох бүрд энэ зүйлд заасны дагуу хураамжийн зоосыг холбогдох түрийвч(үүд)-ээс хасна. Аливаа тэмцээнд оролцохын тулд  урьдчилж тогтоосон мөнгөн дүнг түрийвчнээс хасахдаа дараах байдлаар хасна: (1) Хэрэв байгаа тохиолдолд бонус түрийвч (зөвхөн тогтмол хувь); (2) Хадгаламжийн түрийвч; (3) дараа нь хураамжийн үлдэгдэл дүнг хожлын түрийвчээс хасна. Энд заасан нөхцөлийг үл харгалзан Бүртгэлийн бонус (анх удаагаа Аппликейшнд бүртгүүлэх үед таны дансанд орсон урамшууллын дүн) Хадгаламжийн түрийвчинд орох бөгөөд үүнийг аппликейшн дээр тоглоом тоглоход ашиглаж болно. .</p>
              <p className="mb-2">4.3 Ашиглагдаагүй бонус (өөр ямар ч нэрээр нэрлэгдсэн) зоос нь дансанд орсон өдрөөс хойш 7 хоногийн дараа хугацаа нь дуусна.</p>
              <p className="mb-2">4.4 Тэмцээнд оролцохтой холбоотойгоор танд төлөх зоос үлдсэн тохиолдолд Платформ дээрх бэлэн төлбөрийн хэрэгслийг ашиглан хийхийг танаас хүснэ.</p>
              <p className="mb-2">4.5 Хожлын түрийвч рүү орсон эсвэл Хадгаламжийн түрийвчинд байршуулсан бүх зоосыг  90 хоногийн дотор ашиглах ёстой. Хэрэв  хадгаламжийн түрийвч эсвэл хожлын түрийвчинд ашиглагдаагүй зоос  90 хоног өнгөрсний дараа байгаа тохиолдолд бид ашиглаагүй зоосыг танд ямар нэгэн нөхөн төлбөр төлөх үүрэг хүлээхгүйгээр хураан авах эрхтэй. Бид данс болон гүйлгээтэй холбоотой бүртгэлийг холбогдох хууль тогтоомжид заасан, зөвшөөрөгдсөн хугацаанд хөтөлнө.</p>
              <p className="mb-2">4.6 Gbattle түрийвчнээс хожсон мөнгийг хоёр аргаар авах боломжтой (i) Мобайл мөнгөний данс (ii) Урьдчилсан төлбөрт үлдэгдэл. Гэвч хэрэглэгч түрийвч хооронд зоосоо авах боломжгүй. Ямар ч үед зөвхөн нэг түрийвч идэвхтэй байх бөгөөд зөвхөн тодорхой төлбөрийн аргаар авах боломжтой.</p>
              <p className="mb-2">4.7 Хожлын түрийвч дэх мөнгөн дүнгээ татан авах бол аппликейшн дээр хэрэглэгч хүсэлт гарган зааврын дагуу хийнэ.</p>
              <p className="mb-2">4.8 Хожилд хамаарах аливаа татвар, шимтгэл, хураамж гэх мэтийг тоглоомын ялагч төлнө. Ботсвана улсын аливаа төрлийн тоглоомын хожилд хамаарах (эх сурвалжаас шууд суутгах татвар) дүрэмд үндэслэн Ботсван улсад мөрдөгдөж буй орон нутгийн хуулийн дагуу нэг тоглолтод хожсон мөнгөнөөс татвар авна. </p>
              <p className="mb-2">4.9 Гуравдагч этгээд төлбөрийн үйлчилгээ үзүүлэхэд хугацаа зарцуулагдана гэдгийг Хэрэглэгч хүлээн зөвшөөрч буй бөгөөд гуравдагч этгээдээс хамаарах гадны шалтгааны улмаас  манай Аппликешн дээрх аливаа гүйлгээг боловсруулахад 48 хүртэлх цаг зарцуулагдаж болохыг Хэрэглэгч хүлээн зөвшөөрнө.  Хадгаламжийн түрийвч эсвэл хожлын түрийвч рүү төлсөн эсвэл шилжүүлсэн аливаа мөнгө Хадгаламжийн түрийвч эсвэл хожлын түрийвчид орох хүртэл 48 цаг зарцуулагдана. Үүний нэгэн адил, Хадгаламжийн түрийвч эсвэл хожлын түрийвчнээс хасагдсан мөнгөн дүнгийн зарцуулалт нь Хадгаламжийн түрийвч эсвэл хожлын түрийвчний зоосны үлдэгдлээс хасагдах хүртэл 48 цаг зарцуулагдана. Таны дансанд гүйлгээний дүн тооцогдох хүртэл удсаны улмаас аливаа тэмцээн, уралдаанд оролцох боломжоо алдсан гэх мэт саатал үүссэнтэй холбогдуулан та бидний эсрэг ямар нэгэн гомдол, нэхэмжлэл гаргахгүй гэдгээ зөвшөөрч байна.</p>
              <p className="mb-2">4.10 Гүйлгээ нь баталгаажсан тохиолдолд эцсийнх бөгөөд цуцлахыг үл зөвшөөрнө.</p>
              <p className="mb-2">4.11 Бид тодорхой онцгой нөхцөл байдал, зөвхөн өөрсдийн үндэслэлээр, цуцалсны хураамж, татварыг хассаны дараа таны мөнгийг буцаан олгох боломжтой. Гүйлгээ хийх үед зарим нэмэлт нөхцөл, болзлыг танд танилцуулж болох бөгөөд эдгээр нэмэлт нөхцөлүүд тухайн гүйлгээг зохицуулна. Нэмэлт нөхцөл нь одоогийн нөхцөлтэй зөрчилдөж буй аливаа заалтыг агуулж байгаа тохиолдолд нэмэлт нөхцөл, болзлыг баримтална.</p>
              <p className="mb-2">4.12 Бид аливаа шагнал, урамшуулал, бонусыг (бүртгэлийн урамшуулал үүнд багтана) хэдийд ч (бонус эхэлсний дараа болон таныг ашиглахын өмнө) сунгах, цуцлах, өөрчлөх, хүчинтэй байх хугацааг хязгаарлах, хэмжээ, нөхцлийг өөрчлөх эрхтэй. Мөн бид бонус (бүртгүүлэх урамшуулал гэх мэт), урамшуулал, шагнал, санал гэх мэтийг нэвтрүүлэх, дараа нь хүчинтэй байх хугацааг эсвэл эсрэгээр өөрийн үзэмжээр хүссэн үедээ өөрчлөх эрхтэй гэдгийг үүгээр сануулж байна.</p>
            </div>
            <div>
              <h3 className="font-bold my-2">Тавдугаар зүйл - Үнийн өөрчлөлт</h3>
              <p className="mb-2">
              5.1 Компани нь вэбсайтад урьдчилан зарласны дараа, захиалагч нарт мессежээр мэдэгдсэний дараа үнийг өөрийн талаас хэзээ ч өөрчлөх эрхтэй. Эцсийн хэрэглэгч компанийн үйлчилгээг үргэлжлүүлэн ашиглах эсвэл үнэ өөрчлөгдсөн өдрөөс хойш бүртгүүлснээр шинэ төлбөрийг хүлээн зөвшөөрнө.
              </p>
            </div>
            <div>
              <h3 className="font-bold my-2">
              Зургаадугаар зүйл - Дуусгавар болох, цуцлах
              </h3>
              <p className="mb-2">
              6.1 Контент үйлчилгээ нь зөвхөн вэбсайтад заасны дагуу дуусгавар болж болно.
              </p>
              <p className="mb-2">
              6.2 Хэрэв (а) Эцсийн хэрэглэгч нь Үйлчилгээ үзүүлэгчтэй хийсэн үүрэн телефоны захиалгын заасан хугацаанд төлбөрөө төлөөгүй эсвэл (б) Компани (i) эцсийн хэрэглэгчийг Үйлчилгээний нөхцөл, Контентын нөхцөлийг зөрчсөн гэх үндэслэл байгаа эсвэл (ii) Үйлчилгээ үзүүлэгчээс зохих ёсоор ажиллахыг тодорхой шаардсан бол Компани нь эцсийн хэрэглэгчдэд үзүүлэх бүх Контент үйлчилгээг нэн даруй цуцалж болно.
              </p>
              <p className="mb-2">
              6.3 Компани нь дээр дурдсан шалтгаанаар Контентын үйлчилгээг зогсоосны үр дүнд эцсийн хэрэглэгч болон/эсвэл гуравдагч этгээдийн өмнө хариуцлага хүлээхгүй.
              </p>
              <p className="mb-2">
              6.4 Эцсийн хэрэглэгчдэд өгөх контентын үйлчилгээний хугацаа дууссан тохиолдолд эцсийн хэрэглэгч нь захиалгаар хүлээн авсан Контентын үйлчилгээ эсвэл зээлийн үлдэгдэл төлбөрийг нөхөн төлөх эрхгүй.
              </p>
            </div>
            <div>
              <h3 className="font-bold my-2">Долоодугаар зүйл - Зохиогчийн эрх</h3>
              <p className="mb-2">
              7.1 Энэхүү Нөхцөлд өөрөөр заагаагүй бол Контент үйлчилгээ болон/эсвэл Вэбсайт дахь бүх патент, зохиогчийн эрх, барааны тэмдэг, дизайны эрх, загварын эрх болон/эсвэл бусад (зохиогчийн эрх) эрх нь Компани, түүний ханган нийлүүлэгч эсвэл бусад хууль ёсны эзэмшигчид хамаарна.
              </p>
              <p className="mb-2">
              7.2 Компани нь эцсийн хэрэглэгчдэд Контент үйлчилгээг хүлээн авах болон/эсвэл сурталчлах зорилгоор ашиглах хязгаарлагдмал, онцгой бус, бусдад шилжүүлэх боломжгүй, чөлөөтэй цуцлах боломжтой эрхийг олгоно.
              </p>
              <p className="mb-2">
              7.3 Компаниас өөрөөр заагаагүй бол эцсийн хэрэглэгч нь хүлээн авсан контентын үйлчилгээг компаниас бичгээр шууд зөвшөөрөл авалгүй ямар нэг байдлаар хуулбарлах, өөрчлөх, гүйцэтгэх, шилжүүлэх, түгээх, худалдах, үүсмэл бүтээгдэхүүн бий болгох, ямар нэгэн байдлаар ашиглахыг шууд хориглоно. 
              </p>
              <p className="mb-2">
              7.4 Эцсийн хэрэглэгч нь контентын үйлчилгээг зөвшөөрөлгүй ашигласнаас үүдэн Компани болон гуравдагч этгээдийн зохиогчийн эрхийн зөрчлийн үр дагаврыг Компанид нөхөн төлж, Компанийн өмнө хариуцлага хүлээнэ.
              </p>
            </div>
            <div>
              <h3 className="font-bold my-2">Наймдугаар зүйл - Хариуцлага</h3>
              <p className="mb-2">
              8.1 Компанийн контентын үйлчилгээ болон вэбсайтыг ашиглах нь зөвхөн эцсийн хэрэглэгчийн хариуцлагаас хамаарна. Компани нь Контент үйлчилгээг саадгүй ашиглах боломжоор хангахыг хичээнэ. Компани нь Контент үйлчилгээ нь эцсийн хэрэглэгчийн шаардлагад нийцэж байгаа эсэх, мөн Контент үйлчилгээг татаж авах, хүлээн авах болон/эсвэл сурталчлах нь тасалдал, алдаагүй байна гэсэн баталгаа өгөхгүй.
              </p>
              <p className="mb-2">
              8.2 Контент үйлчилгээ зэрэг гар утасны харилцаа холбооны үйлчилгээ идэвхтэй холболт шаарддаг, холболтын чанар байршил, цаг хугацаа бүрд ижил эсвэл хангалттай биш байгаад Контент үйлчилгээнд сөргөөр нөлөөлж эсвэл түр хугацаагаар ажиллахгүй байх боломжтойг эцсийн хэрэглэгч хүлээн зөвшөөрч байна. Байгалийн хүчин зүйлээс (хонгил, уулс, барилга гэх мэт) үүссэн хөндлөнгийн нөхцөл эсвэл Үйлчилгээ үзүүлэгчийн сүлжээнд өөрчлөлт оруулах, засвар үйлчилгээ хийснээс үүдэн үйлчилгээ тасалдах боломжтой.
              </p>
              <p className="mb-2">
              8.3. Хэрэв эцсийн хэрэглэгч ямар ч үед платформын үйлчилгээг тасралтгүй ашиглах боломжгүй бол энэ нь Платформ үйлчилгээний төлбөрийг бууруулах эсвэл аль хэдийн хийсэн төлбөрийг буцаан авах нөхцөл болохгүй.
              </p>
              <p className="mb-2">
              8.4 Ямар ч тохиолдолд Компани нь Вэбсайт руу нэвтрэх эсвэл хүлээн авсан Контент үйлчилгээ эсвэл Контент үйлчилгээг ашигласнаас үүдэн эцсийн хэрэглэгчийн техник хангамж болон/эсвэл программ хангамжид үүссэн гэмтэл зэрэг аливаа төрлийн хохирлыг хариуцахгүй. Энэ мэт хохирлоос зайлсхийхийн тулд шаардлагатай арга хэмжээг авах нь эцсийн хэрэглэгчийн үүрэг юм.
              </p>
              <p className="mb-2">
              8.5 Дээр дурдсанаас үл хамааран Компани нь эцсийн хэрэглэгчдэд аливаа төрлийн шууд болон шууд бус хохирлыг нөхөн төлөх үүрэгтэй тохиолдолд энэхүү нөхөн төлбөр нь хохирол учруулсан гэж үзэж буй Контент үйлчилгээний нэхэмжлэлийн үнээс хэтрэхгүй байх болно.
              </p>
              <p className="mb-2">
              8.6 Вэбсайтын контентод хөгжүүлэлт сайн хийгдсэн. Гэхдээ Компани нь энэхүү мэдээллийн мөн чанар, үнэн зөв байдал, агуулгад ямар ч баталгаа өгөх боломжгүй. Компани нь интернэтийн хэрэглээ эсвэл холбогдох мэдээллээс үүдсэн аливаа алдаа, орхигдсон, буруу тайлбар, ташаа ойлголт, саатал, хүчингүй захиалга үүсэх, мэдэгдлийг хариуцахгүй.
              </p>
              <p className="mb-2">
              8.7 Эцсийн хэрэглэгч нь хуудуутай мессежийг компани руу илгээх үүрэгтэй бөгөөд ийм мессежийг илгээснээс үүдэн гарах шууд болон үр дагаварт учирсан хохирлыг Компанид нөхөн төлнө.
              </p>
            </div>
            <div>
              <h3 className="font-bold my-2">Есдүгээр зүйл - Хариуцлага</h3>
              <p className="mb-2">
              9.1 Компанийн контентын үйлчилгээ болон вэбсайтыг ашиглахад зөвхөн эцсийн хэрэглэгчийн хариуцлагаас хамаарна.  Компани нь Контент үйлчилгээг саадгүй ашиглах боломжоор хангахыг хичээнэ. Компани нь Контент үйлчилгээ нь эцсийн хэрэглэгчийн шаардлагад нийцэж байгаа эсэх, мөн Контент үйлчилгээг татаж авах, хүлээн авах болон/эсвэл сурталчлах нь тасалдал, алдаагүй байна гэсэн баталгаа өгөхгүй.
              </p>
              <p className="mb-2">
              9.2 Контент үйлчилгээ зэрэг гар утасны харилцаа холбооны үйлчилгээ идэвхтэй холболт шаарддаг, холболтын чанар байршил, цаг хугацаа бүрд ижил эсвэл хангалттай биш байгаад Контент үйлчилгээнд сөргөөр нөлөөлж эсвэл түр хугацаагаар ажиллахгүй байх боломжтойг эцсийн хэрэглэгч хүлээн зөвшөөрч байна. Байгалийн хүчин зүйлээс (хонгил, уулс, барилга гэх мэт) үүссэн хөндлөнгийн нөхцөл эсвэл Үйлчилгээ үзүүлэгчийн сүлжээнд өөрчлөлт оруулах, засвар үйлчилгээ хийснээс үүдэн үйлчилгээ тасалдах боломжтой.
              </p>
              <p className="mb-2">
              9.3. Хэрэв эцсийн хэрэглэгч ямар ч үед платформын үйлчилгээг тасралтгүй ашиглах боломжгүй бол энэ нь Платформ үйлчилгээний төлбөрийг бууруулах эсвэл аль хэдийн хийсэн төлбөрийг буцаан авах нөхцөл болохгүй.
              </p>
              <p className="mb-2">
              9.4 Ямар ч тохиолдолд Компани нь Вэбсайт руу нэвтрэх эсвэл хүлээн авсан Контент үйлчилгээ эсвэл Контент үйлчилгээг ашигласнаас үүдэн эцсийн хэрэглэгчийн техник хангамж болон/эсвэл программ хангамжид үүссэн гэмтэл зэрэг аливаа төрлийн хохирлыг хариуцахгүй. Энэ мэт хохирлоос зайлсхийхийн тулд шаардлагатай арга хэмжээг авах нь эцсийн хэрэглэгчийн үүрэг юм.
              </p>
              <p className="mb-2">
              9.5 Дээр дурдсанаас үл хамааран Компани нь эцсийн хэрэглэгчдэд аливаа төрлийн шууд болон шууд бус хохирлыг нөхөн төлөх үүрэгтэй тохиолдолд энэхүү нөхөн төлбөр нь хохирол учруулсан гэж үзэж буй Контент үйлчилгээний нэхэмжлэлийн үнээс хэтрэхгүй байх болно.
              </p>
              <p className="mb-2">
              9.6 Вэбсайтын контентод хөгжүүлэлт сайн хийгдсэн. Гэхдээ Компани нь энэхүү мэдээллийн мөн чанар, үнэн зөв байдал, агуулгад ямар ч баталгаа өгөх боломжгүй. Компани нь интернэтийн хэрэглээ эсвэл холбогдох мэдээллээс үүдсэн аливаа алдаа, орхигдсон, буруу тайлбар, ташаа ойлголт, саатал, хүчингүй захиалга үүсэх, мэдэгдлийг хариуцахгүй.
              </p>
              <p className="mb-2">
              9.7 Эцсийн хэрэглэгч нь хуудуутай мессежийг компани руу илгээх үүрэгтэй бөгөөд ийм мессежийг илгээснээс үүдэн гарах шууд болон үр дагаварт учирсан хохирлыг Компанид нөхөн төлнө.
              </p>
            </div>
            <div>
              <h3 className="font-bold my-2">
              Аравдугаар зүйл - Мэдээлэл боловсруулах
              </h3>
              <p className="mb-2">
              10.1 Эцсийн хэрэглэгчдэд үйлчилгээ үзүүлэхийн тулд компани нь эцсийн хэрэглэгчийн талаарх хувийн болон ашиглалтын талаар тодорхой мэдээллийг цуглуулж, хадгалдаг бөгөөд үүнийг өөрөө болон түүний түншүүд арилжааны зорилгоор ашиглах болно.
              </p>
              <p className="mb-2">
              10.2 Компани нь эцсийн хэрэглэгчийн мэдээллийг зөвхөн өөрийн нууцлалын мэдэгдэлд заасны дагуу боловсруулах бөгөөд үүнийг вэбсайтаас үзэх, татаж авах боломжтой. Эцсийн хэрэглэгч нь дээр дурдсан мэдээлэл боловсруулалтыг хүлээн зөвшөөрч, ашиглахыг зөвшөөрнө.
              </p>
            </div>
            <div>
              <h3 className="font-bold my-2">
              Арваннэгдүгээр зүйл - Холбогдох хууль тогтоомж
              </h3>
              <p className="mb-2">
              11.1 Эдгээр нөхцөл, болзол, Нууцлалын бодлого, Буцаан олгох, солих, цуцлах, буцаалтын бодлогыг Ботсваны хуулиар зохицуулах бөгөөд Энэтхэгийн Нью Дели хотын шүүх аливаа маргааныг шийдвэрлэх онцгой эрх мэдэлтэй байна.
              </p>
            </div>
            <div>
              <p className="mt-6 mb-2 font-bold">
              Компани нь нэг талын журмаар, ямар ч үед эдгээр Нөхцөлүүдийг тодорхой хугацаанд өөрчлөх эрхтэй. Өөрчлөлтийг компанийн вэбсайт дээр нийтлэх замаар захиалагчдад мэдэгдэх ёстой. Хэрэв эдгээр өөрчлөлтүүд хийгдэх заасан хугацааны дараа захиалагчид Gbattle-ийн үргэлжлүүлэн ашиглах эсвэл үйлчилгээг хүлээн авах юм бол эдгээр өөрчлөлтийг бүхэлд нь хүлээн зөвшөөрсөн гэж үзнэ.
              </p>
            </div>
          </div>
        </div>
      </div>
    </>
  );
}

export default TermsAndConditions;
